In [2]:
try:
    file = open('new_file.csv','x')
    file.close()
except:
    print("The file already exists ")

In [2]:
import pandas as pd
df=pd.read_csv('new_file.csv')
df

   sn     name  age      address       phone
0   1      ram   39     ranighat  9811857755
1   2  pranjal   19    baneshwor  9864125996
2   3   sweeta   20  buddhanagar  9764125996
3   4    shika   19  buddhanagar  9804205758
4   5   pramod   28      birgunj  9802926012

In [3]:
print(df)

   sn     name  age      address       phone
0   1      ram   39     ranighat  9811857755
1   2  pranjal   19    baneshwor  9864125996
2   3   sweeta   20  buddhanagar  9764125996
3   4    shika   19  buddhanagar  9804205758
4   5   pramod   28      birgunj  9802926012

In [4]:
df=pd.read_csv('new_file.csv')
df.head()

   sn     name  age      address       phone
0   1      ram   39     ranighat  9811857755
1   2  pranjal   19    baneshwor  9864125996
2   3   sweeta   20  buddhanagar  9764125996
3   4    shika   19  buddhanagar  9804205758
4   5   pramod   28      birgunj  9802926012

In [5]:
df=pd.read_csv('new_file.csv')
df.head(3)

   sn     name  age      address       phone
0   1      ram   39     ranighat  9811857755
1   2  pranjal   19    baneshwor  9864125996
2   3   sweeta   20  buddhanagar  9764125996

In [6]:
df=pd.read_csv('new_file.csv')
df.tail(3)

   sn    name  age      address       phone
2   3  sweeta   20  buddhanagar  9764125996
3   4   shika   19  buddhanagar  9804205758
4   5  pramod   28      birgunj  9802926012

In [10]:
df=pd.read_csv('new_file.csv')
df.iloc[1:4]

   sn     name  age      address       phone
1   2  pranjal   19    baneshwor  9864125996
2   3   sweeta   20  buddhanagar  9764125996
3   4    shika   19  buddhanagar  9804205758

In [12]:
df=pd.read_csv('new_file.csv')
df.iloc[1:4,0:3]

   sn     name  age
1   2  pranjal   19
2   3   sweeta   20
3   4    shika   19

In [13]:
df=pd.read_csv('new_file.csv',usecols=['sn','name','phone'])
df

   sn     name       phone
0   1      ram  9811857755
1   2  pranjal  9864125996
2   3   sweeta  9764125996
3   4    shika  9804205758
4   5   pramod  9802926012

In [14]:
df=pd.read_csv('new_file.csv')
list(df['name'])

['ram', 'pranjal', 'sweeta', 'shika', 'pramod']

In [19]:
df=pd.read_csv('new_file.csv')
df['name']=='ram',

(0     True
 1    False
 2    False
 3    False
 4    False
 Name: name, dtype: bool,)

In [20]:
df=pd.read_csv('new_file.csv')
df[df['name']=='ram']

   sn name  age   address       phone
0   1  ram   39  ranighat  9811857755

In [23]:
df=pd.read_csv('new_file.csv')
df[df['age']>20]

   sn    name  age   address       phone
0   1     ram   39  ranighat  9811857755
4   5  pramod   28   birgunj  9802926012

In [29]:
df=pd.read_csv('new_file.csv')
df[(df['age']>20) & (df['address']=='birgunj')]

   sn    name  age  address       phone
4   5  pramod   28  birgunj  9802926012

In [31]:
data=df[df['age']>20] 
data.to_csv('new_age_data.csv')

In [35]:
df=pd.read_csv('new_file.csv',index_col = 0)
df

       name  age      address       phone
sn
1       ram   39     ranighat  9811857755
2   pranjal   19    baneshwor  9864125996
3    sweeta   20  buddhanagar  9764125996
4     shika   19  buddhanagar  9804205758
5    pramod   28      birgunj  9802926012

In [39]:
df.loc[2:5]

       name  age      address       phone
sn
2   pranjal   19    baneshwor  9864125996
3    sweeta   20  buddhanagar  9764125996
4     shika   19  buddhanagar  9804205758
5    pramod   28      birgunj  9802926012

In [48]:
data={'name':['ram','shyam','hari'],
     'age':[78,59,96],
     'address':['kathmandu','bhaktapur','lalitpur']}
df=pd.DataFrame(data)
df.to_csv('info.csv')
df

    name  age    address
0    ram   78  kathmandu
1  shyam   59  bhaktapur
2   hari   96   lalitpur

In [49]:
import csv
with open('info.csv') as csvfile:
    reader =csv.DictReader(csvfile)
    for row in reader:
        print(row)

{'': '0', 'name': 'ram', 'age': '78', 'address': 'kathmandu'}
{'': '1', 'name': 'shyam', 'age': '59', 'address': 'bhaktapur'}
{'': '2', 'name': 'hari', 'age': '96', 'address': 'lalitpur'}

In [51]:
data=[['name','age','address'],
     ['ram',45,'kathmandu'],
     ['hari',56,'lalitpur']]
file = open('list_file.csv','w')
x=csv.writer(file)
x.writerows(data)
file.close()

In [52]:
pwd

'C:\\Users\\HP\\Desktop\\jupyter'